In [13]:
from selenium import webdriver
from selenium.webdriver.common.keys import Keys
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.common.by import By
from selenium.webdriver.support import expected_conditions as EC
import csv
import openpyxl
import time
import pandas as pd

In [14]:
#loading the excel file
df=pd.read_excel('/Users/andreamaffei/Desktop/Masters/Classes/Spring Semester/Programming/Project/results/results.xlsx')

In [15]:
df.head()

,Company Name,Staff Name,Title,Address
0,A - 1 FOOD MART CORPORATION,JAVED SHAIKH,PRESIDENT,"11 RANDALL ST #2 WALTHAM, MA 02453 USA"
1,A - 1 FOOD MART CORPORATION,AMRIN SHAIKH,TREASURER,"11 RANDALL ST #2 WALTHAM, MA 02453 USA"
2,A - 1 FOOD MART CORPORATION,JAVED SHAIKH,SECRETARY,"11 RANDALL ST #2 WALTHAM, MA 02453 USA"
3,A - 1 FOOD MART CORPORATION,JAVED SHAIKH,DIRECTOR,"11 RANDALL ST #2 WALTHAM, MA 02453 USA"
4,A - 1 FOOD MART CORPORATION,AMRIN SHAIKH,DIRECTOR,"11 RANDALL ST #2 WALTHAM, MA 02453 USA"

In [17]:
#populating the new columns with the first and last name of the staff
df['First Name'] = df['Staff Name'].str.split(' ').str[0]

#ppopulating the new columns with the last name of the staff,  taken from reading right to left until the first space
df['Last Name'] = df['Staff Name'].str.split(' ').str[-1]

#put Columns First Name First and Columns Last Name second in the dataframe
df = df[['First Name', 'Last Name', 'Staff Name', 'Title', 'Address']]

In [18]:
df.tail()

,First Name,Last Name,Staff Name,Title,Address
13,MICHAEL,DUVAL,MICHAEL P. DUVAL,DIRECTOR,"72 DAYTON ST. DANVERS, MA 01923 USA"
14,JOSE,ANDRADE,JOSE ANDRADE,PRESIDENT,"24 NORTH WALKER STREET TAUNTON, MA 02780 USA"
15,JOSE,ANDRADE,JOSE ANDRADE,TREASURER,"24 NORTH WALKER STREET TAUNTON, MA 02780 USA"
16,JOSE,ANDRADE,JOSE ANDRADE,SECRETARY,"24 NORTH WALKER STREET TAUNTON, MA 02780 USA"
17,JOSE,ANDRADE,JOSE ANDRADE,DIRECTOR,"24 NORTH WALKER STREET TAUNTON, MA 02780 USA"